org/encryption.org
#+HUGO_BASE_DIR: ../
#+TITLE: Encryption
#+DATE: <2021-05-03 Mon 17:24>
#+HUGO_AUTO_SET_LASTMOD: t
#+HUGO_TAGS: 
#+HUGO_CATEGORIES: 
#+HUGO_DRAFT: false

Encryption is the method by which information is converted into secret code that
hides the information's true meaning. The science of encrypting and decrypting
information is called cryptography. In computing, unencrypted data is also known
as plaintext, and encrypted data is called ciphertext.

** Cryptomator
https://cn.apkjam.com/cryptomator.html\\
https://jsntn.com/software/portable-cryptomator.html
** Password
KeePass https://haikebang.com/passphrase.html
** Saferoom
https://cn.apkjam.com/60s/saferoom.html
** TrueCrypt/VeraCrypt/EDS/CryptoDisk
TrueCrypt is not secure https://jsntn.com/software/2014/06/01/truecrypt.html\\
EDS https://cn.apkjam.com/eds.html
** Read More
https://haikebang.com/secure-portable.html
