content/posts/encryption.md
+++
title = "Encryption"
date = 2021-05-03T17:24:00+08:00
lastmod = 2021-05-06T01:59:30+08:00
draft = false
+++

Encryption is the method by which information is converted into secret code that
hides the information's true meaning. The science of encrypting and decrypting
information is called cryptography. In computing, unencrypted data is also known
as plaintext, and encrypted data is called ciphertext.


## Cryptomator {#cryptomator}

<https://cn.apkjam.com/cryptomator.html><br />
<https://jsntn.com/software/portable-cryptomator.html>


## Password {#password}

KeePass <https://haikebang.com/passphrase.html>


## Saferoom {#saferoom}

<https://cn.apkjam.com/60s/saferoom.html>


## TrueCrypt/VeraCrypt/EDS/CryptoDisk {#truecrypt-veracrypt-eds-cryptodisk}

TrueCrypt is not secure <https://jsntn.com/software/2014/06/01/truecrypt.html><br />
EDS <https://cn.apkjam.com/eds.html>


## Read More {#read-more}

<https://haikebang.com/secure-portable.html>
